## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_ingress_v1.argocd_ingress must be replaced
-/+ resource "kubernetes_ingress_v1" "argocd_ingress" {
!       id     = "default/argocd-ingress" -> (known after apply)
!       status = [
-           {
-               load_balancer = [
-                   {
-                       ingress = [
-                           {
-                               hostname = ""
-                               ip       = "167.172.231.132"
                            },
                        ]
                    },
                ]
            },
        ] -> (known after apply)

!       metadata {
!           generation       = 1 -> (known after apply)
-           labels           = {} -> null
            name             = "argocd-ingress"
!           namespace        = "default" -> "argocd" # forces replacement
!           resource_version = "68861" -> (known after apply)
!           uid              = "b19a29bb-9279-4265-8a85-54cbb3277404" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

!       spec {
!           default_backend {

!               service {
                    name = "argocd"

!                   port {
                        # (1 unchanged attribute hidden)
                    }
                }
            }

!           rule {
                # (1 unchanged attribute hidden)

!               http {
!                   path {
                        # (2 unchanged attributes hidden)

!                       backend {

!                           service {
                                name = "argocd-argo-cd-serve"

!                               port {
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
